Terraform plan for __dev__
<details>
  <summary>Plan: 9 to add, 1 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_dns_record_set.inventory_postgres_a_record will be created
  + resource "google_dns_record_set" "inventory_postgres_a_record" {
      + id           = (known after apply)
      + managed_zone = "ebo-dev-private-dns-managed-zone"
      + name         = "inventory.postgres.commerce.internal."
      + project      = "ebo-dev-321910"
      + rrdatas      = [
          + "10.4.0.3",
        ]
      + ttl          = 300
      + type         = "A"
    }

  # random_string.dev_team_db_password will be created
  + resource "random_string" "dev_team_db_password" {
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + override_special = "@#%&*()-_=+[]{}<>:?"
      + result           = (known after apply)
      + special          = true
      + upper            = true
    }

  # random_string.inventory_app_user_name will be created
  + resource "random_string" "inventory_app_user_name" {
      + id          = (known after apply)
      + length      = 8
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # random_string.inventory_app_user_password will be created
  + resource "random_string" "inventory_app_user_password" {
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + override_special = "@#%&*()-_=+[]{}<>:?"
      + result           = (known after apply)
      + special          = true
      + upper            = true
    }

  # random_string.inventory_password will be created
  + resource "random_string" "inventory_password" {
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + override_special = "@#%&*()-_=+[]{}<>:?"
      + result           = (known after apply)
      + special          = true
      + upper            = true
    }

  # module.inventory_google_postgres.google_sql_database.default[0] will be created
  + resource "google_sql_database" "default" {
      + charset   = "UTF8"
      + collation = "en_US.UTF8"
      + id        = (known after apply)
      + instance  = "inventory-651bf40758-3a3c6dd8"
      + name      = "inv"
      + project   = "ebo-dev-321910"
      + self_link = (known after apply)
    }

  # module.inventory_google_postgres.google_sql_database_instance.default will be updated in-place
  ~ resource "google_sql_database_instance" "default" {
      ~ deletion_protection           = true -> false
        id                            = "inventory-651bf40758-3a3c6dd8"
        name                          = "inventory-651bf40758-3a3c6dd8"
        # (10 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.inventory_google_postgres.google_sql_user.additional_users["dev-read-user"] will be created
  + resource "google_sql_user" "additional_users" {
      + host     = (known after apply)
      + id       = (known after apply)
      + instance = "inventory-651bf40758-3a3c6dd8"
      + name     = "dev-read-user"
      + password = (sensitive value)
      + project  = "ebo-dev-321910"
    }

  # module.inventory_google_postgres.google_sql_user.default[0] will be created
  + resource "google_sql_user" "default" {
      + host     = (known after apply)
      + id       = (known after apply)
      + instance = "inventory-651bf40758-3a3c6dd8"
      + name     = (known after apply)
      + password = (sensitive value)
      + project  = "ebo-dev-321910"
    }

  # module.inventory_google_postgres.random_id.user-password will be created
  + resource "random_id" "user-password" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "name" = "inventory-651bf40758-3a3c6dd8"
        }
    }

Plan: 9 to add, 1 to change, 0 to destroy.
```
</details>

Plan generated in [Terraform #21](https://github.com/ebomart/commerce-infrastructure/actions/runs/1153615154)